INSERT INTO `t_category` (`id`, `platform`, `tenant_id`, `biz_type`, `cate_type`, `cate_code`, `cate_name`, `cate_desc`, `icon_url`, `pid`, `leaf`, `level`, `back_categories`, `root_cate_id`, `order_seq`, `extension`, `creator`, `updater`, `is_pre`, `is_delete`, `gmt_create`, `gmt_modified`)
VALUES
	(1, 8, '', 'ticket', 1, '01', '技术工单', 'iot平台技术工单', 'https://www.tuya.com/test.png', 0, 0, 1, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(2, 8, '', 'ticket', 1, '0101', '业务相关模块', '业务相关模块', 'https://www.tuya.com/test.png', 1, 0, 2, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(3, 8, '', 'ticket', 1, '0102', '平台功能模块', '平台功能模块', 'https://www.tuya.com/test.png', 1, 0, 2, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(4, 8, '', 'ticket', 1, '0103', '产品功能模块', '产品功能模块', 'https://www.tuya.com/test.png', 1, 0, 2, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(5, 8, '', 'ticket', 1, '0104', '产品量产', '产品量产', 'https://www.tuya.com/test.png', 1, 0, 2, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 业务相关模块树id=2：
--     一级
	(6, 8, '', 'ticket', 1, '010101', '涂鸦介绍及合作咨询', '涂鸦介绍及合作咨询', 'https://www.tuya.com/test.png', 2, 0, 3, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(7, 8, '', 'ticket', 1, '010102', '项目方案及跟进', '项目方案及跟进', 'https://www.tuya.com/test.png', 2, 0, 3, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(8, 8, '', 'ticket', 1, '010103', '采购及费用中心', '采购及费用中心', 'https://www.tuya.com/test.png', 2, 0, 3, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(9, 8, '', 'ticket', 1, '010104', '平台增值服务相关', '平台增值服务相关', 'https://www.tuya.com/test.png', 2, 0, 3, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 业务相关模块树--->涂鸦介绍及合作咨询id=6
	(10, 8, '', 'ticket', 1, '01010101', '涂鸦介绍', '涂鸦介绍', 'https://www.tuya.com/test.png', 6, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(11, 8, '', 'ticket', 1, '01010102', '合作咨询', '合作咨询', 'https://www.tuya.com/test.png', 6, 1, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(12, 8, '', 'ticket', 1, '01010103', '行业解决方案咨询', '行业解决方案咨询', 'https://www.tuya.com/test.png', 6, 1, 4, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	业务相关模块树--->项目方案及跟进id=7
	(13, 8, '', 'ticket', 1, '01010201', '智能硬件方案设计咨询', '智能硬件方案设计咨询', 'https://www.tuya.com/test.png', 7, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(14, 8, '', 'ticket', 1, '01010202', '项目进度咨询', '项目进度咨询', 'https://www.tuya.com/test.png', 7, 1, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	业务相关模块树--->采购及费用中心id=8
	(15, 8, '', 'ticket', 1, '01010301', '采购商品', '采购商品', 'https://www.tuya.com/test.png', 8, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(16, 8, '', 'ticket', 1, '01010302', '交易管理', '交易管理', 'https://www.tuya.com/test.png', 8, 0, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 业务相关模块树--->采购及费用中心id=8--->交易管理id=16
	(17, 8, '', 'ticket', 1, '0101030201', '发票', '发票', 'https://www.tuya.com/test.png', 16, 1, 5, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(18, 8, '', 'ticket', 1, '0101030202', '地址', '地址', 'https://www.tuya.com/test.png', 16, 1, 5, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(19, 8, '', 'ticket', 1, '0101030203', '优惠券', '优惠券', 'https://www.tuya.com/test.png', 16, 1, 5, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	业务相关模块树--->采购及费用中心id=8
	(20, 8, '', 'ticket', 1, '01010303', '订单管理', '订单管理', 'https://www.tuya.com/test.png', 8, 1, 4, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(21, 8, '', 'ticket', 1, '01010304', '合同管理', '合同管理', 'https://www.tuya.com/test.png', 8, 1, 4, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(22, 8, '', 'ticket', 1, '01010305', '费用管理', '费用管理', 'https://www.tuya.com/test.png', 8, 1, 4, '', 1, 5, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	业务相关模块树--->平台增值服务相关id=9
	(23, 8, '', 'ticket', 1, '01010401', 'APP服务', 'APP服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(24, 8, '', 'ticket', 1, '01010402', '智能音箱服务', '智能音箱服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(25, 8, '', 'ticket', 1, '01010403', '认证服务', '认证服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(26, 8, '', 'ticket', 1, '01010404', '智慧运营服务', '智慧运营服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(27, 8, '', 'ticket', 1, '01010405', '功能拓展服务', '功能拓展服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 5, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(28, 8, '', 'ticket', 1, '01010406', '摄像机服务', '摄像机服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 6, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(29, 8, '', 'ticket', 1, '01010407', '营销服务', '营销服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 7, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(30, 8, '', 'ticket', 1, '01010408', '定制开发服务', '定制开发服务', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 8, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	todo
	(31, 8, '', 'ticket', 1, '01010409', '其他', '其他', 'https://www.tuya.com/test.png', 9, 1, 4, '', 1, 9, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	平台功能模块树id=3:
-- 	一级：
	(32, 8, '', 'ticket', 1, '010201', '平台账号相关', '平台账号相关', 'https://www.tuya.com/test.png', 3, 0, 3, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(33, 8, '', 'ticket', 1, '010202', '平台产品相关', '平台产品相关', 'https://www.tuya.com/test.png', 3, 0, 3, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(34, 8, '', 'ticket', 1, '010203', '数据运营中心', '数据运营中心', 'https://www.tuya.com/test.png', 3, 0, 3, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(35, 8, '', 'ticket', 1, '010204', '平台bug反馈', '平台bug反馈', 'https://www.tuya.com/test.png', 3, 1, 3, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	平台功能模块树--->平台账号相关id=32
	(36, 8, '', 'ticket', 1, '01020101', '授权管理', '授权管理', 'https://www.tuya.com/test.png', 32, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(37, 8, '', 'ticket', 1, '01020102', '注册及登陆问题', '注册及登陆问题', 'https://www.tuya.com/test.png', 32, 1, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(38, 8, '', 'ticket', 1, '01020103', '等级及权益问题', '等级及权益问题', 'https://www.tuya.com/test.png', 32, 1, 4, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
-- 	平台功能模块树--->平台产品相关id=33
	(39, 8, '', 'ticket', 1, '01020201', '产品管理', '产品管理', 'https://www.tuya.com/test.png', 33, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(40, 8, '', 'ticket', 1, '01020202', 'PBT打标', 'PBT打标', 'https://www.tuya.com/test.png', 33, 1, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(41, 8, '', 'ticket', 1, '01020203', '产品认证', '产品认证', 'https://www.tuya.com/test.png', 33, 1, 4, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(42, 8, '', 'ticket', 1, '01020204', '其他', '其他', 'https://www.tuya.com/test.png', 33, 1, 4, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
--  平台功能模块树--->数据运营中心id=34
	(43, 8, '', 'ticket', 1, '01020301', '设备管理', '设备管理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 1, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(44, 8, '', 'ticket', 1, '01020302', '设备日志查询 ', '设备日志查询 ', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 2, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(45, 8, '', 'ticket', 1, '01020303', 'App用户管理', 'App用户管理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 3, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(46, 8, '', 'ticket', 1, '01020304', 'App闪屏管理', 'App闪屏管理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 4, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(47, 8, '', 'ticket', 1, '01020305', '消息中心', '消息中心', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 5, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(48, 8, '', 'ticket', 1, '01020306', '短信发送记录', '短信发送记录', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 6, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(49, 8, '', 'ticket', 1, '01020307', '知识库管理', '知识库管理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 7, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(50, 8, '', 'ticket', 1, '01020308', '用户反馈', '用户反馈', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 8, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(51, 8, '', 'ticket', 1, '01020309', '告警处理', '告警处理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 9, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(52, 8, '', 'ticket', 1, '01020310', '经销商管理', '经销商管理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 10, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(53, 8, '', 'ticket', 1, '01020311', '出货管理', '出货管理', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 11, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(54, 8, '', 'ticket', 1, '01020312', '数据概况', '数据概况', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 12, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(55, 8, '', 'ticket', 1, '01020313', '设备统计', '设备统计', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 13, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(56, 8, '', 'ticket', 1, '01020314', 'App分析', 'App分析', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 14, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(57, 8, '', 'ticket', 1, '01020315', '故障统计', '故障统计', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 15, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(58, 8, '', 'ticket', 1, '01020316', '用户反馈', '用户反馈', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 16, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(59, 8, '', 'ticket', 1, '01020317', '设备工况分析', '设备工况分析', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 17, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),
	(60, 8, '', 'ticket', 1, '01020318', '其他', '其他', 'https://www.tuya.com/test.png', 34, 1, 4, '', 1, 18, '{"templateId": 1}', '六和', '六和', 0, 0, 1517906411600, 1517906411600),





